OdIfcModelContext.getTargetCRSScale
\details
Retrieves a Target CRS map units of IfcMapConversion application scenario.
\returns type of Target CRS map units application scenario.
\remarks
kScaleOnly is value by default.
Experimental feature.

OdIfcModelContext.setTargetCRSScale(OdIfcModelContext.TargetCRCScale)
\details
Sets a Target CRS map units of IfcMapConversion application scenario.
\remarks
Experimental feature.

OdIfcModelContext.getDrawSpaces
\details
Retrieves a value that determines if draw IfcSpace elements needed or not.
\returns true if draw IfcSpace elements is needed, otherwise returns false.
\remarks
Turned off by default.

OdIfcModelContext.setDrawSpaces(System.Boolean)
\details
Sets a value that determines if draw IfcSpace elements needed or not.
\param val [in] a new value for draw IfcSpace elements.

OdIfcModelContext.getDrawSpacesTransparency
\details
Retrieves a value that determines transparency value for IfcSpace elements.
\returns  Float value that determines current transparency for IfcSpace items that should be draw.
\remarks
Set to 0.85 by default.

OdIfcModelContext.setDrawSpacesTransparency(System.Single)
\details
Sets a value that determines transparency value for IfcSpaces that should be draw.
\param val [in] a new value for transparency.

OdIfcModelContext.getDrawPoints
\details
Retrieves a value that determines if draw IfcRepresentationItem based on IfcCartesianPoint elements needed or not.
\returns true if draw IfcCartesianPoint elements is needed, otherwise returns false.
\remarks
Turned on by default.

OdIfcModelContext.setDrawPoints(System.Boolean)
\details
Sets a value that determines if draw IfcRepresentationItem based on IfcCartesianPoint elements needed or not.
\param val [in] a new value for draw IfcRepresentationItem elements.

OdIfcModelContext.getPointRepresentation
\details
Retrieves a value that determines visual type of IfcCartesianPoint elements.
\returns PointRepresentation value that is  selected for IfcCartesianPoint elements.

OdIfcModelContext.setPointRepresentation(OdIfcModelContext.PointRepresentation)
\details
Sets a value that determines visual type of IfcCartesianPoint elements.
\param val [in] a PointRepresentation value for draw IfcRepresentationItem elements.
\remarks
kPoint by default.

OdIfcModelContext.setComposeOutOfSpatialStructure(System.Boolean)
\details
Sets a value that determines if compose of IfcElement instances which out of IFC model spatial structure needed or not.
\param val [in] a new value for compose IfcElement instance which are out of spatial structure.

OdIfcModelContext.getComposeOutOfSpatialStructure
\details
Retrieves a value that determines if compose of IfcElement instances which out of IFC model Spatial Structure needed or not.
\returns true if compose of out of spatial structure IfcElements is needed, otherwise returns false.
\remarks
Turned on by default.

OdIfcModelContext.getDrawOpeningsTransparency
\details
Retrieves a value that determines transparency value for openings.
\returns  Float value that determines currwnt transparency for openings that should be draw.
\remarks
Set to 0.05 by default.

OdIfcModelContext.setDrawOpeningsTransparency(System.Single)
\details
Sets a value that determines transparency value for openings that should be draw.
\param val [in] a new value for transparency.

OdIfcModelContext.getDrawOpenings
\details
Retrieves a value that determines if draw IfcOpenings elements needed or not.
\returns true if draw IfcOpenings elements is needed, otherwise returns false.
\remarks
Turned off by default.

OdIfcModelContext.setDrawOpenings(System.Boolean)
\details
Sets a value that determines if draw IfcOpenings elements needed or not.
\param val [in] a new value for draw IfcOpenings elements.

OdIfcModelContext.setGeometryComposeTypes(OdArray&lt;OdIfc.OdIfcEntityType,OdObjectsAllocator&lt;OdIfc.OdIfcEntityType&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets an array of types which instances should participate in geometry compose process to this IFC model context.
\param geometryComposeTypes [in] an array of IFC entity types for geometry compose.
\remarks
Types should be derived from IfcProduct.

OdIfcModelContext.getGeometryComposeTypes
\details
Retrieves an array of types which instances should participate in geometry compose process.
\returns an array of IFC entity types for geometry compose.
\remarks
Types should be derived from IfcProduct.

OdIfcModelContext.#ctor(OdDeviationParams,OdCmEntityColor)
\details
Creates a new model context object with specified deviation parameters and color.
\param params [in] Deviation parameters.
\param color  [in] Default model color value.

OdIfcModelContext
\details
A class that implements working with an IFC model context.